{
    "_id": { "$oid": "5cfe78b71c9d440000cb31cd" },
    "author": "Elise Bauer",
    "image": "https://www.simplyrecipes.com/wp-content/uploads/2012/09/mexican-green-rice-horiz-a-1400-1024x713.jpg",
    "ingredients": ["3 Tbsp olive oil", "1/2 cups long grain white rice\"",
        "1/4 cups chicken stock (or more depending on your rice)",
        "1 cup roughly chopped parsley, lightly packed",
        "1/2 cup roughly chopped cilantro, lightly packed",
        "2 large poblano chiles, seeded and roughly chopped",
        "2 Tbsp chopped onion",
        "1 garlic clove, peeled, roughly chopped",
        "Salt to taste"
    ],
    "recipe_name": "Mexican Green Rice",
    "cook_time": "45 minutes",
    "country": "Mexican Recipes",
    "directions": ["Purée parsley, cilantro, chiles, onion, garlic, 1/2 cup of stock: Place the parsley, cilantro, poblanos, onion, garlic, and 1/2 cup of the chicken stock in a food processor. Pulse until smooth.",
        "Brown the rice: Heat the oil in a thick-bottomed pot on high heat. the rice and stir to coat all of the grains with oil. Spread out in an even layer. Let the rice lightly brown. When it starts to brown, stir it and spreadit out in an even layer again so that more of the rice browns. ",
        "Stir parsley cilantro mixture into rice: When much of the rice has lightly browned, scrape outthe parsley purée from the food processor into the rice. Stir to evenly mix the purée with the rice. Let cook for a minute or two.",
        "Add remaining stock, simmer, cover, cook: Add the rest of the chicken stock to the pot. Bring to a boil, then reduce the heat to a low simmer and cover the pot. Let cook on a very low simmer for 15 minutes, or as long as your package of rice indicates is the right cooking time for your rice.",
        "Remove from heat, cover with towel and lid, let sit: After the cooking time indicated on your rice package, remove the pot from heat. Uncover the pot and place a clean terry towel or dish towel over the pot, then re-cover. The towel will helpabsorb excess liquid as the rice continues to cook in its own steam. (If you don't have a clean towel, you can skip this step, just cover normally.) Let sit for 20 minutes. Fluff the rice with a fork and serve."
    ],
    "prep_time": "10 minutes"
}
